import { MenuType } from "../../types/headerType/menuType";

export const menuItems: MenuType[] = [

    {
        id: 1,
        title: {

            ru: 'Для одежды',
            ua: 'Для одягу',

        },

        fabrics: {
            ru: [
                
                'Глитер',
                'Люрекс',
                'Гапограта',
                'Плащёвые',
                'Курточные',
                'Искуственные меха',
                'Кожзам',
                'Атлас',
                'Шелк',
                'Сатин',
                'Бархат',
                'Велюр',
                'Вельвет',
                'Бифлекс',
                'Дайвинг',
                'Микро Дайвинг',
                'Лакра',
                'Диско',
                'Джинс',
                'Котон',
                'Лён',
                'Штапель',
                'Трикотаж',
                'Костюм',
                'Шифон',
                'Пальто',
                'Гипюр',
                'Фатин',
                'Евросетка',
                'Сетка',
                'Макраме',
                'Паетки',
                
            ],

            ua: [
                
                'Глітер',
                'Люрекс',
                'Гапограта',
                'Плащові',
                'Курткові',
                'Штучне хутро',
                'Шкірзам',
                'Атлас',
                'Шовк',
                'Сатін',
                'Оксамит',
                'Велюр',
                'Вельвет',
                'Біфлекс',
                'Дайвінг',
                'Мікро Дайвінг',
                'Лакра',
                'Диско',
                'Джинс',
                'Котон',
                'Льон',
                'Штапель',
                'Трикотаж',
                'Костюм',
                'Шифон',
                'Пальто',
                'Гіпюр',
                'Фатін',
                'Євросітка',
                'Сітка',
                'Макраме',
                'Паетки',
                
            ],
        },
    },

    {
        id: 2,
        title: {

            ru: 'Для дома',
            ua: 'Для дому'

        },

        fabrics: {
            ru: [
                
                'Непромокаемые',
                'Махровые',
                'Муслин',
                'Хлопок',
                'Котон',
                'Сатин',
                'Скатертные',
                'Плюшевые',
                'Обивные',
                'Наполнители',
                'Утеплители',
                'Поролон',
                'Клей',
                'Тюлевые',
                'Буквенные',
                'Драки',
                'Тосьма',

            ],

            ua: [
                
                'Непромокальні',
                'Махрові',
                'Муслін',
                'Бавовна',
                'Котон',
                'Сатін',
                'Скатертні',
                'Плюшеві',
                'Оббивні',
                'Наповнювачі',
                'Утеплювачі',
                'Поролон',
                'Клей',
                'Тюльові',
                'Літарні',
                'Бійки',
                'Тосьма',
                
            ]
        }
    },

    {
        id: 3,

        title: {

            ru: 'Постельные принадлежности',
            ua: 'Постільні приналежності',

        },

        fabrics: {

            ru: [

                'Постельные комплекты',
                'Подушки',
                'Одеяло',
                'Полотенце',
                'Ковры',
                'Скатерти',

            ],

            ua: [

                'Постільні комплекти',
                'Подушки',
                'Ковдра',
                'Рушник',
                'Килими',
                'Скатертини',

            ],

        },

    },

    {
        id: 4,

        title: {

            ru: 'Фурнитура',
            ua: 'Фурнітура'

        },

        fabrics: {

            ru: [

                'Нитки',
                'Иголки',
                'Змейки',
                'Резинки',
                'Пуговицы',

            ],

            ua: [

                'Нитки',
                'Голки',
                'Змійки',
                'Гумки',
                'Гудзики',

            ],

        },

    },

    {
        id: 5,

        title: {

            ru: 'Распродажа',
            ua: 'Розпродаж'

        },

        fabrics: {

            ru: [

                'Empty list'

            ],

            ua: [

                'Empty list'

            ],

        },

    },

    {
        id: 6,

        title: {

            ru: 'Контакты',
            ua: 'Контакти'

        }
    },
  
    {
        id: 7,

        title: {

            ru: 'Доставка/Оплата',
            ua: 'Доставка/Оплата',

        },

    },

];
