import { TranslationType } from "../types/translateType/translationType";

export const translations: TranslationType = {

  ru: {

    warning: 'Уважаемые клиенты! Магазин "Textile-Pro" в Одессе работает ежедневно c 9:00 до 19:00.',
    contacts: 'Контакты',
    socialNetworks: 'Социальные сети:',
    address: 'Адреса магазина...',
    alexander: '067 487 25 58 | Александр',
    olga: '067 487 60 67 | Ольга',
    cotton: 'Хлопчатобумажные',
    linen: 'Лен',
    knitwear: 'Трикотаж',
    silks: 'Шелка',
    costume: 'Костюмные',
    guipure: 'Гипюр',
    sequins: 'Пайетки',
    chiffon: 'Шифон',
    atlas: 'Атлас',
    velours: 'Велюр',
    tulle: 'Фатин',
    jeans: 'Джинс',
    shop: 'Интернет магазин тканей',
    firstPart: `
     В эпоху массового производства все большей редкостью становятся изделия,
     в которых ощущается индивидуальность.Вы не хотите носить одежду, сшитую поточным методом,
     без учета ваших потребностей и предпочтений? Устали от стандартной мебели и штор в своем доме? 
     Эта проблема решается.И одежду, и шторы, и обивку для мягкой мебели, и постельное белье можно пошить на заказ.
     А начать следует с выбора ткани.Именно от нее во многом зависит, получится ли сшитое изделие таким, как вы задумали.
     Наш интернет- магазин тканей может предложить варианты практически на любой случай жизни.
     У нас собрано все самое востребованное,
     поэтому вам больше не нужно посещать разные торговые точки в поисках оптимального решения своей проблемы.
     Когда бы вам ни понадобились ткани, интернет- магазин для вас открыт.
     Мы работаем не только по Одессе.Находясь в любой точке Украины, можно купить ткань онлайн в нашем магазине.`,
    why: 'Почему мы?',
    secondPart: `
     В нашем магазине вас ждут атлас и сатин, гипюр и кружево, плащево-курточные, пальтовые и костюмные ткани,
     искусственная кожа и мех, шелка, шифоны, джинс и многое другое. Здесь можно подобрать интерьерные ткани,
     которые преобразят ваш дом, помогут создать в нем именно ту атмосферу, о которой вы мечтаете.
     Не так уж и трудно найти в Украине магазин, предлагающий купить ткани через интернет в розницу и оптом.
     Почему стоит делать покупки у нас?
     В каталоге представлено более 20 000 позиций тканей.
     Мы стремимся обеспечить высокое качество сервиса и при этом сделать наш товар доступным по цене.
     Предусмотрено несколько удобных вариантов оплаты и доставки.
     Несмотря на разнообразие товара, позавидовать которому может практически любой магазин Украины, 
     купить ткань оптом или в розницу у нас вы сможете, не прилагая усилий.
     В каталоге предусмотрена возможность сортировки по типам материала, расцветкам, составу,
     дизайну и региону производства. Задав необходимые параметры, вы очень быстро найдете именно то, что вас интересует.
     Мы приглашаем вас начать путешествие в мире тканей. Надеемся, что, однажды совершив покупку, вы будете возвращаться сюда снова и снова.`,

  },

  ua: {

    warning: 'Шановні клієнти! Магазин "Textile-Pro" в Одесі працює щоденно з 9.00 до 19.00.',
    contacts: 'Контакти',
    socialNetworks: 'Соціальні мережі:',
    address: 'Адреси магазину...',
    alexander: '067 487 25 58 | Олександр',
    olga: '067 487 60 67 | Ольга', 
    cotton: 'Бавовняні',
    linen: 'Льон',
    knitwear: 'Трикотаж',
    silks: 'Шовку',
    costume: 'Костюмні',
    guipure: 'Гіпюр',
    sequins: 'Паєтки', 
    chiffon: 'Шифон',
    atlas: 'Атлас',
    velours: 'Велюр',
    tulle: 'Фатин',
    jeans: 'Джинс',
    shop: 'Інтернет магазин тканин',
    firstPart: `
    У період масового виробництва дедалі більше рідкістю стають вироби, 
    у яких відчувається індивідуальність. Ви не хочете носити одяг, зшитий поточним методом,
    без урахування ваших потреб та переваг? Втомилися від стандартних меблів та штор у своєму будинку?
    Ця проблема вирішується. І одяг, і штори, і оббивку для м'яких меблів, і постільна білизна можна пошити на замовлення.
    А почати слід із вибору тканини. Саме від неї багато в чому залежить, чи вийде вишитий виріб таким, як ви задумали. 
    Наш інтернет магазин тканин може запропонувати варіанти практично на будь-який випадок життя.
    У нас зібрано все, що найбільше затребуване, тому вам більше не потрібно відвідувати різні торгові 
    точки в пошуках оптимального вирішення своєї проблеми. Коли б вам не знадобилися тканини,
    інтернет-магазин відкрито для вас. Ми працюємо не лише по Одесі.
    Перебуваючи у будь-якій точці України, можна купити тканину онлайн у нашому магазині.
    `,
    why: 'Чому ми?',
    secondPart:`
    У нашому магазині на вас чекають атлас та сатин, гіпюр та мереживо,
    плащово-курткові, пальтові та костюмні тканини, штучна шкіра та хутро, шовку, шифони,
    джинс та багато іншого. Тут можна підібрати інтер'єрні тканини, які перетворять вашу оселю,
    допоможуть створити в ній саме ту атмосферу, про яку ви мрієте.
    Не так вже й важко знайти в Україні магазин, який пропонує купити тканини через інтернет в роздріб та гуртом.
    Чому варто купувати у нас?
    У каталозі представлено понад 20 000 позицій тканин.
    Ми прагнемо забезпечити високу якість сервісу та при цьому зробити наш товар доступним за ціною.
    Передбачено декілька зручних варіантів оплати та доставки.
    Незважаючи на різноманітність товару, позаздрити якому може практично будь-який магазин України,
    купити тканину оптом чи в роздріб у нас ви зможете, не докладаючи зусиль. 
    У каталозі передбачена можливість сортування за типами матеріалу, забарвленням,
    складом, дизайном та регіоном виробництва. Задавши необхідні параметри, 
    ви дуже швидко знайдете саме те, що вас цікавить.
    Ми запрошуємо вас розпочати подорож у світі тканин.
    Сподіваємося, що, якось здійснивши покупку, ви повертатиметеся сюди знову і знову.
    `,

  },

};
